# Pandas
## Basics
### Series
1. pd.Series(data=, index=) 或者是通过python dict进行传入
2. 能够通过index 或者是相应的位置进行索引
3. values属性能够获取所有值，index能够获取所有索引
4. name属性是Series的名称；index.name是索引的名称

In [1]:
import pandas as pd 
import numpy as np
from pandas import DataFrame, Series

s1 = pd.Series(np.arange(0,10,2),index=('a','b','c','d','e'))
s1

a    0
b    2
c    4
d    6
e    8
dtype: int64

In [2]:
s1['c']

4

In [3]:
s1[2]

4

In [4]:
s1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
s1.name = "random nums"
s1.index.name = "alphabet"
s1

alphabet
a    0
b    2
c    4
d    6
e    8
Name: random nums, dtype: int64

### DataFrame
1. pd.DataFrame(data,columns=,index=) 或者 通过pytho dict进行传入，每一列是一个python list
2. 建立DataFrame的时候如果有的列不存在数据，会留下空洞 因此还用使用 nest dict 或者是 Series 建立DataFrame的方法
2. head() 方法返回表格前几行；
3. 对已有表格使用pd.DataFrame(data, columns=[]) 可以按顺序显示所有列
4. 从DataFrame中获取Series： 使用[]索引 或者直接以属性的方式获取列名称
5. index 和 columns都有name属性；DataFrame每一列都是一个 Series，列名称就是Series的name属性
6. values会返回一个二维的ndarray，dtype会返回一个最大的父类

In [6]:
from pandas import DataFrame
import numpy as np

samp_dict = {
    'year': [2008, 2009, 2010, 2011, 2012],
    'state': ["Ohio","California","Washington", "Nevada","Oregon"],
    'price':[200,500,340,230,900]
}
samp = pd.DataFrame(samp_dict)
samp

   year       state  price
0  2008        Ohio    200
1  2009  California    500
2  2010  Washington    340
3  2011      Nevada    230
4  2012      Oregon    900

In [7]:
samp.year

0    2008
1    2009
2    2010
3    2011
4    2012
Name: year, dtype: int64

In [8]:
samp["state"]

0          Ohio
1    California
2    Washington
3        Nevada
4        Oregon
Name: state, dtype: object

#### index
1. index以及columns是一个set，但是能够接受重复的列名称
2. index可以进行集合的交并补操作，同时能够添加、插入、删除，没有的数据将会以空位的形式出现
3.

### commonly used methods
1. reindex(index, columns,method='ffill|bfill', fill_value, limit, tolerance ) 重新定义行标，没有数据的位置将会留下空洞
2. drop() 如果是删除行，直接输入行名称或行名称list即可；如果是删除列，那么需要axis=1或者是axis='column'；另外删除是返回一个新的对象，如果直接修改原对象，<font color=red>inplace=True</font>
3. Series 优先选取行，DataFrame优先选取列，支持通过名称、位置进行选取，支持分块选取（块是一个完全的闭区间），同时也支持布尔选取
4. DataFrame选取行的方法：loc-通过index名称选取 iloc-通过行的逻辑位置选取；loc 和 iloc都能够通过传入第二个位置参数来确定选取哪一列
5.

#### arithmetics
1. 如果使用普通的运算符号，那么不存在的行或者列会留下空洞$(NaN)$
2. 需要进行填充，需要使用内置函数 add(fill_value) sub(fill_value) div(fill_value) mul(fill_value) pow(fill_value) floordiv(fill_value) 前面加上r则是交换操作数的位置顺序
3. 同样，DataFrame和Series进行计算的时候，遵循Numpy的广播法则，行计算可以直接广播，但是列计算需要使用内置函数，添加axis='index'或axis=0 参数进行规约;
4. 如果DataFrame与Series进行计算时有的行或者列不存在，pandas会首先进行reindex操作
5. DataFrame接收numpy ufunc函数，作用对象是全体数据np.abs np.sqrt ...
6. DataFrame可以使用apply()函数接收自定义聚合函数，作用于一整列（也就是一个独立的Series，默认）或者是一整行（使用axis=columns 或axis=1进行规约)
7. applymap()可以将自定义函数作用于全体数据，本质上是在作用到Series后Series本身自带一个map函数

In [9]:
import pandas as pd
import numpy as np

frame = pd.DataFrame(np.arange(12).reshape(4,3),
                     columns=list('bde'),
                     index=['Utah',"California",'Ohio','Texas'])
series= frame.iloc[0]
print(series)
frame

b    0
d    1
e    2
Name: Utah, dtype: int64

            b   d   e
Utah        0   1   2
California  3   4   5
Ohio        6   7   8
Texas       9  10  11

#### calculation over rows

In [10]:
frame - series

            b  d  e
Utah        0  0  0
California  3  3  3
Ohio        6  6  6
Texas       9  9  9

In [11]:
series = frame.iloc[:,1]
series

Utah           1
California     4
Ohio           7
Texas         10
Name: d, dtype: int64

#### calculation over columns

In [12]:
frame.sub(series,axis="index")

            b  d  e
Utah       -1  0  1
California -1  0  1
Ohio       -1  0  1
Texas      -1  0  1

#### apply for aggregation function

In [13]:
frame = pd.DataFrame(np.random.randn(4,5),
                    columns=list("abcde"),
                    index=['Beijing','Shanghai','Chongqing','Tianjin'])
frame

                  a         b         c         d         e
Beijing   -0.656343  0.792194  0.658560  1.606536  1.366218
Shanghai   1.117954 -0.676052  2.621932 -0.145515 -1.025182
Chongqing -1.749388  0.690545  1.232598  3.061056 -0.815471
Tianjin   -0.613844  0.140733 -0.960486  0.064889  1.031904

In [14]:
frame.apply(lambda x: x.max() - x.min())

a    2.867342
b    1.468246
c    3.582418
d    3.206571
e    2.391400
dtype: float64

In [15]:
frame.apply(lambda x: x.max() - x.min(), axis=1)

Beijing      2.262879
Shanghai     3.647114
Chongqing    4.810443
Tianjin      1.992390
dtype: float64

In [16]:
frame.applymap(lambda x: '%.2f' % x)

               a      b      c      d      e
Beijing    -0.66   0.79   0.66   1.61   1.37
Shanghai    1.12  -0.68   2.62  -0.15  -1.03
Chongqing  -1.75   0.69   1.23   3.06  -0.82
Tianjin    -0.61   0.14  -0.96   0.06   1.03

#### sort
1. sort_index(axis=0, ascending=False)
2. sort_values(ascending=False), $NaN$会被放置在最后，视为无穷大
3. sort_values(by=[]) by参数指定以哪一列进行排序
4. rank(axis,ascedning=False, method="average"|"min"|"max"|"first") method的方法实际上就是在解决相同ranking的过程中
5. DataFrame没有规定index不能够重复，但是重复的index会影响sort和rank的结果，如果有多个index，那么iloc或者是loc函数将会返回一个Series，使用.index.is_unique()能够确定是否存在相同的index

#### summerizing methods
1. 所有的聚合函数[Reduction methods]默认都是在Series间进行的，也就是说axis=0，修改这一选项的参数是axis=‘column'或者是asix=1;聚合函数默认不计算$NaN$，控制这一特性的参数是skipna=False;这一类聚合函数有 sum mean max min avg
2. 统计学上的聚函数有 var std skew kurt
2. 还有accumulation methods 会按照顺序进行输出，比如 cumsum cumprod 
3. idmax idmin 相当于numpy中的argmax 和 argmin； idmax和argmax的区别在于id直接返回index名称，而arg返回的是位置
4. count describe

#### statistics methods
1. corr cov
2. 以上两个函数，可以计算两个DataFrame之间的(corrwith covwith)，也可以计算一个DataFrame与一列之间的(worrwith covwith)，也可以计算两列之间的(cov corr)，需要调整参数，<font color= red>即为列索引的两种方式df["column"] | df.column</font>

In [17]:
co_data = pd.DataFrame(np.random.randn(4,3),
                       index=list("abcd"),
                       columns=["Shanghai","Beijing","Chongqing"])
co_data

   Shanghai   Beijing  Chongqing
a  2.002898  0.778038   0.427568
b -1.436270  1.357190   1.397207
c  0.703072  0.074722  -0.435284
d -2.308098 -0.414702   1.212865

In [18]:
co_data.cov()

           Shanghai   Beijing  Chongqing
Shanghai   3.875511  0.361598  -1.193422
Beijing    0.361598  0.606380   0.175156
Chongqing -1.193422  0.175156   0.700817

In [19]:
co_data.corr()

           Shanghai   Beijing  Chongqing
Shanghai   1.000000  0.235879  -0.724148
Beijing    0.235879  1.000000   0.268689
Chongqing -0.724148  0.268689   1.000000

In [20]:
co_data.corrwith(co_data.Shanghai)

Shanghai     1.000000
Beijing      0.235879
Chongqing   -0.724148
dtype: float64

In [21]:
co_data.Beijing.corr(co_data.Shanghai)

0.2358787442964535

In [22]:
co_data.corrwith(co_data)

Shanghai     1.0
Beijing      1.0
Chongqing    1.0
dtype: float64

#### screening methods
1. unique() 返回不重复但是不排名的结果
2. value_counts(sort=False) 返回各个结果的计数值，默认不排序
3. isin(list) 返回一个boolean数组，指示该位置数据是否在list之中

## read write
1. from hard desk or from URL
2. hard desk - different data formats [csv hdf plain text]
3. URL - json html xml

### hard desk
1. read_csv read_table - plain text data with , or \t as dlimiter
2. read_excel
3. read_hdf
4. read_json read_html
5. read_pickle
6. read_sas read_sql read_stata read_reather

#### read_csv
1. read_csv = read_table(sep=',')
2. read_csv 参数<br>
header=None 跳过第一行<br>
names=[] 重新指定表头行<br>
index_col=[] 重新指定索引行，如果是list则按照列表顺序构造层级索引<br>
sep= 数据分隔符，可以使用正则表达式<br>
skiprows = [] 指定跳过哪几行<br>
na_values=[] na_values={} 指定哪些值被视作是NaN，列表作用于全DF，字典每一个key对应一列Series <br>
nrows 指定读入的行数<br>

### write
1. to_csv(file_name, sep= , na_rep= , index= False, header=False)

### read data with different delimiters
1. module csv
2. csv.reader

In [23]:
import os 

os.path.abspath('.')

'/Users/collinsliu/jupyter/python_learning_basics'

In [24]:
import csv

f = open('datas/example07.csv')
reader = csv.reader(f)

In [25]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']
['tom', 'lucy', 'david']

### cutomize data reader
1. csv.reader(lineterminator=, delimiter=, quotechar=, skipinitialspace=False)参数能够自定义一些内容
2. 或者使用reader进行源数据与dict之间的转换

In [26]:
with open("datas/example07.csv") as f:
    lines = list(csv.reader(f))
header, values = lines[0], lines[1:]
data_dict = {h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1', 'tom'), 'b': ('2', '2', 'lucy'), 'c': ('3', '3', 'david')}

### json
1. module json
2. json.load() json.dump() 直接将json读成dict，将dict转换成json格式
3. pd.read_json() pd.to_json() 直接将json读成DataFrame，将DataFrame转换成json

### html xml
1. module lxml beautifulsoup4 html5lib
2. pandas built-in function: read_html

### binary data format
1. pickle - data serialization|deserialization 
2. read_pickle() to_pickle()
3.

### Web API Interaction
1. module requests
2. get(url) 返回一个response对象，每一个response对象都是一个python dict

In [27]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)

resp

In [28]:
data = resp.json()
data[0]['title']

'BUG: Timestamp.round overflows'

### SQL 
1. module sqlite3
2. or sqlalchemy + pd.read_sql

## cleaning
process of data preparation: loading cleaning transforming rearranging

### missing data
1. sentinel value - NaN
2. all missing data [data holes] will be replaced by NaN
3. isnull() notnull() function
4. dropna(how='all', axis=0, thresh) 
5. fillna(value, method='ffill', axis=0, inplace=False, limit)

#### dropna(how, axis, thresh)

In [29]:
# dropna() for series
# dropna(how="all",axis=0) for dataframe, row-wise and drop if has one NaN by default
import pandas as pd
import numpy as np

exp_arr = pd.DataFrame(np.random.randn(10,3))

In [30]:
exp_arr.iloc[:4,1] = np.NaN
exp_arr.iloc[:2,2] = np.NaN
exp_arr

          0         1         2
0 -0.282760       NaN       NaN
1  1.472436       NaN       NaN
2 -0.845040       NaN  0.735237
3 -1.095616       NaN -1.512652
4 -0.875945 -0.155165  0.654327
5  1.468886 -0.059897  1.555549
6  1.394334  0.368111 -0.055746
7 -0.804795 -0.572474 -0.383448
8  0.179866  2.011752 -0.371873
9  1.238025 -0.049248  0.075153

In [31]:
exp_arr.dropna(axis=0,thresh=2)

          0         1         2
2 -0.845040       NaN  0.735237
3 -1.095616       NaN -1.512652
4 -0.875945 -0.155165  0.654327
5  1.468886 -0.059897  1.555549
6  1.394334  0.368111 -0.055746
7 -0.804795 -0.572474 -0.383448
8  0.179866  2.011752 -0.371873
9  1.238025 -0.049248  0.075153

#### fillna(value,method,axis,inplace,limit)

In [32]:
exp_arr.fillna(exp_arr.mean(),limit=4)

          0         1         2
0 -0.282760  0.257180  0.087068
1  1.472436  0.257180  0.087068
2 -0.845040  0.257180  0.735237
3 -1.095616  0.257180 -1.512652
4 -0.875945 -0.155165  0.654327
5  1.468886 -0.059897  1.555549
6  1.394334  0.368111 -0.055746
7 -0.804795 -0.572474 -0.383448
8  0.179866  2.011752 -0.371873
9  1.238025 -0.049248  0.075153

#### drop_duplicates([columns], keep="first")
1. duplicates() 返回一个以行为单位的boolean Series
2. drop_duplicates() 将会保留duplicated()操作后返回值为False的行

In [33]:
exp_arr2 = pd.DataFrame({"k1":["one","two"]*3 + ["two"],
                         "k2":[1,1,2,3,3,4,4]})
exp_arr2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
exp_arr2.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [35]:
exp_arr2.drop_duplicates(['k1'],keep='last')

    k1  k2
4  one   3
6  two   4

### data transformation
1. map(dict)
2. map(function)
3. replace(ori,des)
4. replace(dic{ori:des})
5. rename(index={ori:des},columns={ori,des},inplace=False)
6. index.map(function) 同样可以做到改变行名称，但是会在原地直接修改

In [36]:
data_arr1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                     'Pastrami', 'corned beef', 'Bacon',
                     'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat_to_animal = {'bacon': 'pig',
                  'pulled pork': 'pig',
                  'pastrami': 'cow',
                  'corned beef': 'cow',
                  'honey ham': 'pig',
                  'nova lox': 'salmon'}

In [37]:
data_arr1["animal"] = data_arr1["food"].map(lambda x: meat_to_animal[x.lower()])
data_arr1

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### binning
1. new pandas object: Categorical
2. pandas.cut(value, bins, labels=, right=False, precision=) 默认是左闭右开的区间
3. pandas.qcut(value, #bins, labels=) 是按照比例分割成#bin数量的区间
2. important attribute in Categorical: codes, categories
3. methods for Categorical pandas.value_counts()

In [38]:
data_arr2 = np.random.randn(1000)
label = ["Apple","Banan","Coconut","Durian"]
cats = pd.qcut(data_arr2, 4, labels=label)
pd.value_counts(cats)

Apple      250
Banan      250
Coconut    250
Durian     250
dtype: int64

In [39]:
cats

['Apple', 'Durian', 'Coconut', 'Durian', 'Banan', ..., 'Coconut', 'Durian', 'Apple', 'Banan', 'Apple']
Length: 1000
Categories (4, object): ['Apple' < 'Banan' < 'Coconut' < 'Durian']

#### replacing

In [40]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017586    -0.007681    -0.049835     0.006045
std       0.955416     1.010088     0.986122     1.016413
min      -2.784011    -3.179625    -2.658744    -4.029148
25%      -0.645109    -0.660227    -0.745331    -0.714232
50%       0.010883    -0.009562    -0.038044     0.008224
75%       0.678522     0.656478     0.612876     0.698715
max       2.958363     3.854548     2.794963     3.225823

In [41]:
data[np.abs(data) > 3].fillna(0).head(5)

     0    1    2    3
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0
4  0.0  0.0  0.0  0.0

In [42]:
data[(np.abs(data)>3).any(1)].fillna(0)

            0         1         2         3
27   0.423533 -1.848017 -0.023541  3.148824
294  0.240673 -3.179625 -1.014350 -0.119099
323  0.943753  3.243925 -1.404744 -1.103809
456  0.433519  0.598823 -0.845604  3.225823
476  0.385804  0.046352 -0.559230 -4.029148
689 -1.225403  3.854548 -1.372414 -0.035020
740  1.057911 -1.387283 -0.516550 -3.030365
782 -0.131432  0.374464 -0.978603 -3.250297

### generate one-hot
1. get_dummies(series, prefix=)
2. series.add_prefix()
3. datafame.columns.get_indexer()
4. combine binning with one-hot: pandas.get_dummins(pd.cut(value, bin, labels, right=False))

In [43]:
np.random.seed(123456)
values = np.random.rand(10)
values

array([0.12696983, 0.96671784, 0.26047601, 0.89723652, 0.37674972,
       0.33622174, 0.45137647, 0.84025508, 0.12310214, 0.5430262 ])

In [44]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
names = ["Apple", "Banana", "Cherry", "Durian", "Elderwood"]
pd.get_dummies(pd.cut(values, bins, labels=names))

   Apple  Banana  Cherry  Durian  Elderwood
0      1       0       0       0          0
1      0       0       0       0          1
2      0       1       0       0          0
3      0       0       0       0          1
4      0       1       0       0          0
5      0       1       0       0          0
6      0       0       1       0          0
7      0       0       0       0          1
8      1       0       0       0          0
9      0       0       1       0          0

### string munging
1. python build-in functions: <font color=red>split('delimiter'), strip()</font>
2. lstrip rstrip ljust rjust count
3. startwith endwith
4. upper lower
2. pythonic string concatenation: <font color=red>+ 或 "delimiter".join(list)</font>
3. python substring location methods: <font color=red>index(char)[raise exception], find(char)</font>
4. replace

### re
module re
1. pattern matching
2. substitution
3. splitting

In [45]:
import re

text = "foo    bar\t  tar  \t qua"

regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'tar', 'qua']

### vectorize string

## Wrangling
### hierarchical index
1. unstack() stack()
2. hierarchical index could happen in both index and column
3. swaplevel(level_a, level_b, axis=0) sort_index(level=, axis=0)
4. change is not in-place 
5. note: sort_index is much faster if sort happens in the outer-most level

In [46]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']])
frame.columns.names = ["state", "color"]
frame.index.names = ["key1","key2"]
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [47]:
frame.swaplevel(0,1,axis=1).sort_index(level=0,axis=1)

color        Green       Red
state     Colorado Ohio Ohio
key1 key2
a    1           2    0    1
     2           5    3    4
b    1           8    6    7
     2          11    9   10

In [48]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [49]:
frame.groupby(level=1,axis=1).sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### groupby transform

<h6>groupby(by=) 返回一个分组，适合聚合函数</h6>
<hr>

2. groupby().get_group() 或 groupby()[index] 能够获取分组
3. groupby().agg(aggregation_function)能够对分组进行聚合函数处理
4. <b><font color=red>groupby().agg({column:aggregation_function})</font></b> 是通用的聚合函数处理方法
5. reset_index() 对聚合结果进行重新添加index的操作
6. rename(columns={ori_name:new_name}) 对聚合结果进行column重命名操作

<h6>transform(aggregation_function) 类似于开窗函数，对每一行的值都返回聚合函数的结果</h6>
<hr>

In [53]:
frame.groupby(['key1']).sum()

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

### index
1. set_index(drop=True) 将columns转化为index
2. reset_index() 将index重新转化为column

In [56]:
frame_2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
        'c': ['one', 'one', 'one', 'two', 'two',
        'two', 'two'],
        'd': [0, 1, 2, 0, 1, 2, 3]})
frame_2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [58]:
frame_2new = frame_2.set_index(['c','d'])
frame_2new

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [60]:
frame_2rev = frame_2new.reset_index()
frame_2rev

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### combinations
1. merge() 行层面连接 - 和sql的join是一个意思
2. concat() 可以指定行或者列连接
3. combine_first() 增加了功能：重复的拼接，缺失的补齐

#### merge
<h6> merge(dataframe1, dataframe2, left_on, right_on, how, suffixes=(), indicator=False, left_index=, right_index)</h6>
<hr></hr>

1. on left_on right_on 指定合并时两表中指定相同的列
2. how 指定合并式的方式 outer inner left right
3. suffixes 用于区分合并后指定相同的列来自于左表还是右表
4. indicator显示数据来自于哪张表，默认为False
5. left_index 与 right_index 指定index作为merge key，而非某一个column

1. 实际上，如果依照index进行join操作，可以直接使用<b><font color=red>left.join(right1,right2,..., on, how)</font></b>进行

In [72]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})    
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})
pd.merge(left, right, 
         on='key1', 
         how='outer',
         suffixes=('_left',"_right"), 
         indicator=True)

  key1 key2_left  lval key2_right  rval _merge
0  foo       one     1        one     4   both
1  foo       one     1        one     5   both
2  foo       two     2        one     4   both
3  foo       two     2        one     5   both
4  bar       one     3        one     6   both
5  bar       one     3        two     7   both

#### concat
1. np.concatenate([array1,array2,...],axis=0)
2. pd.concat([series1,series2,...],axis=0,join="inner"，join_axesjoin_axes=[[index1,index2,...]]) join关键词解决overlap问题

## processing
1. split
2. apply
3. combination

### groupby

1. <font color=red size=4.5><b>DataFrame.groupby( [ function,mapping{dict,Series} ], level=0, axis=0, as_index=False, group_keys=False )[ column ]</b></font>
2. groupby()函数将会返回一个grouped对象，dict(list(grouped))可以将其转换为字典形式
3. 聚合函数可以直接作用在grouped对象上，自定义聚合函数同样也可以<font color=red size=4.5> <b>grouped.agg((name1,function1),(name2,function2)...)</b></font>对所有列使用，或者对每个列规定使用的聚合函数<font color=red size=4.5> <b>grouped.agg( {column1:(name1,function1),(name2,function2)...,column2:...} )</b></font>